/*
3、24名志愿者随机分成两组，每组12人，接受降胆固醇试验，甲组为特殊饮食组，乙组为药物治疗组。受试者试验前后各测量一次血清胆固醇（mmol/L），数据见下表：

甲组  乙组
受试者 试验前 试验后  受试者 试验前 试验后
1 6.11 6.00  1 6.90 6.93
2 6.81 6.83  2 6.40 6.35
3 6.48 4.49  3 6.48 6.41
4 7.59 7.28  4 7.00 7.10
5 6.42 6.30  5 6.53 6.41
6 6.94 6.64  6 6.70 6.68
7 9.17 8.42  7 9.10 9.05
8 7.33 7.00  8 7.31 6.83
9 6.94 6.58  9 6.96 6.91
10 7.67 7.22  10 6.81 6.73
11 8.15 6.57  11 8.16 7.65
12 6.60 6.17  12 6.98 6.52
问题：
（1）试建立能够满足以下统计分析的SAS数据集。
（2）试判断两组受试者试验前血清胆固醇水平是否相等？
（3）分别判断两种降胆固醇措施是否有效？
（4）试判断两种降胆固醇措施的效果是否相同？

*/
data homo;
    input group $ per aft @@;
    diff = aft-per;
    cards;
    A 6.11 6.00 B 6.90 6.93
    A 6.81 6.83 B 6.40 6.35
    A 6.48 4.49 B 6.48 6.41
    A 7.59 7.28 B 7.00 7.10
    A 6.42 6.30 B 6.53 6.41
    A 6.94 6.64 B 6.70 6.68
    A 9.17 8.42 B 9.10 9.05
    A 7.33 7.00 B 7.31 6.83
    A 6.94 6.58 B 6.96 6.91
    A 7.67 7.22 B 6.81 6.73
    A 8.15 6.57 B 8.16 7.65
    A 6.60 6.17 B 6.98 6.52
    ;
run;

proc ttest data = homo h0=0;*分组检验per;
    class group;
    var per;
run;

proc ttest data=homo;*成对检验A;
    paired per*aft;
    where group = "A";
run;

proc ttest data=homo;*成对检验B;
    paired per*aft;
    where group = "B";
run;

proc ttest data=homo;*分组检验difference;
    class group;
    var diff;
run;