/*
2、某研究员欲分析急性染毒对肝脏功能的影响，将40只小鼠分为两组，雄雌各半，试验组进行急性染毒试验，染毒后2小时测定血液中的ALT，整理的结果见下表。 
（1）	比较雄性实验组与对照组的ALT有无差异；
（2）	比较雌性实验组与对照组的ALT有无差异；
ALT
NO. male    Female
control     Treaetment  control     Treaetment
1	38.4	57.8	39.7	55.7
2	30.6	62.4	34.6	63.8
3	25.5	57.5	40.5	59.9
4	29.9	49.9	44.3	49.7
5	29.0	55.6	41.2	48.8
6	33.6	47.3	25.6	51.3
7	39.4	50.1	30.6	53.8
8	42.5	48.7	37.6	42.6
9	46.7	57.9	39.5	61.7
10	49.3	60.4	25.1	65.3
*/

data male;
    input id ctrlM tretM @@;
    cards;
	1 38.4 57.8
	2 30.6 62.4
	3 25.5 57.5
	4 29.9 49.9
	5 29.0 55.6
	6 33.6 47.3
	7 39.4 50.1
	8 42.5 48.7
	9 46.7 57.9
	10 49.3 60.4
    ;
run;

data female;
    input id ctrlF tretF @@;
    cards;
	1 39.7 55.7
	2 34.6 63.8
	3 40.5 59.9
	4 44.3 49.7
	5 41.2 48.8
	6 25.6 51.3
	7 30.6 53.8
	8 37.6 42.6
	9 39.5 61.7
	10 25.1 65.3
    ;
run;

proc ttest data=male;
    Paired ctrlM*tretM;
run;

proc ttest data=female;
    Paired ctrlF*tretF;
run;