*9月4日练习题3;
/*
用两种饲料喂养8对大鼠后，测得其肝中维生素A的含量（IU/mg），问不同的饲料组鼠肝中维生素A的含量有无显著性差异（条件近似者配对）？
	对子编号
    1   2   3   4   5   6   7   8
	正常饲料组
    3.55   2.00  3.00  3.95  3.80   3.75  3.45   3.05
	缺乏VitE饲料组
    2.45  2.40  1.80 3.20  3.25  2.70  2.50  1.75
*/

data homo;
    input id VitEP VitEN @@;
    diff=VitEP-VitEN;
    cards;
    1 3.55 2.45
    2 2.00 2.40
    3 3.00 1.80
    4 3.95 3.20
    5 3.80 3.25
    6 3.75 2.70
    7 3.45 3.05
    8 3.05 1.75
    ;
run;

proc ttest data=homo;
    var diff;
run;